app/controllers/products_controller.rb

  def create
    @products = Product.all
    @product = Product.create(product_params)
---
SELECT `products`.* FROM `products`
INSERT INTO `products` (`created_at`, `name`, `price`, `updated_at`) VALUES ('2014-05-30 05:52:09', 'Condon durex', 5, '2014-05-30 05:52:09')

  def edit
    @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 1 LIMIT 1

  def update
    @products = Product.all
    @product = Product.find(params[:id])

    @product.update_attributes(product_params)
---
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 2 LIMIT 1
UPDATE `products` SET `price` = 987, `updated_at` = '2014-05-30 05:55:50' WHERE `products`.`id` = 8

  def delete
    @product = Product.find(params[:product_id])
---
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 1 LIMIT 1

  def destroy
    @products = Product.all
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT `products`.* FROM `products`
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 2 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 2